<?php

use Mockery as m;
use Recca0120\Twzipcode\Str;

class StrTest extends PHPUnit_Framework_TestCase
{
    public function tearDown()
    {
        m::close();
    }

    public function setUp()
    {
        $this->units = ['段', '路', '街', '巷', '弄', '號', '樓'];
    }

    public function test_normalize()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        $data = [
            '台北市大安區市府路1之1號',
            '臺北市大安區市府路１之１號',
            '臺北市　大安區　市府路 1 之 1 號',
            '臺北市，大安區，市府路 1 之 1 號',
            '臺北市，大安區，市府路 1 之 1 號',
            '臺北市, 大安區, 市府路 1 之 1 號',
            '臺北市, 大安區, 市府路 1 - 1 號',
        ];

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($data as $address) {
            $Str = new Str($address);
            $this->assertSame('臺北市大安區市府路1之1號', (string) $Str->regularize());
        }
    }

    public function test_digitize_9()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($this->units as $unit) {
            $Str = new Str('臺北市大安區市府四'.$unit);
            $this->assertSame('臺北市大安區市府4'.$unit, (string) $Str->digitize());
        }
    }

    public function test_digitize_14()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($this->units as $unit) {
            $Str = new Str('臺北市大安區市府十四'.$unit);
            $this->assertSame('臺北市大安區市府14'.$unit, (string) $Str->digitize());
        }
    }

    public function test_digitize_94()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($this->units as $unit) {
            $Str = new Str('臺北市大安區市府九十四'.$unit);
            $this->assertSame('臺北市大安區市府94'.$unit, (string) $Str->digitize());
        }
    }

    public function test_digitize_947()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($this->units as $unit) {
            $Str = new Str('臺北市大安區市府九百四十七'.$unit);
            $this->assertSame('臺北市大安區市府947'.$unit, (string) $Str->digitize());
        }
    }

    public function test_digitize_9478()
    {
        /*
        |------------------------------------------------------------
        | Arrange
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Act
        |------------------------------------------------------------
        */

        /*
        |------------------------------------------------------------
        | Assert
        |------------------------------------------------------------
        */

        foreach ($this->units as $unit) {
            $Str = new Str('臺北市大安區市府九千四百七十八'.$unit);
            $this->assertSame('臺北市大安區市府9478'.$unit, (string) $Str->digitize());
        }
    }

    public function test_normalize_address()
    {
        $this->assertSame('新北市板橋區', (string) Str::make('臺北縣板橋市')->normalizeAddress());
        $this->assertSame('臺中市豐原區', (string) Str::make('臺中縣豐原市')->normalizeAddress());
        $this->assertSame('高雄市鳳山區第一', (string) Str::make('高雄縣鳳山市第一')->normalizeAddress());
        $this->assertSame('臺南市新營區', (string) Str::make('臺南縣新營市')->normalizeAddress());
    }
}
